Tekla.Structures.Model.BentPlate
A class for the bent plate
using Tekla.Structures.Geometry3d;
using Tekla.Structures.Model;
public class Example
{
private ContourPlate CreateContourPlate(Point point1, Point point2, Point point3)
{
ContourPoint contourPoint1 =  new ContourPoint(point1, null);
ContourPoint contourPoint2 = new ContourPoint(point2, null);
ContourPoint contourPoint3 = new ContourPoint(point3, null);
ContourPlate CP = new ContourPlate();
CP.AddContourPoint(contourPoint1);
CP.AddContourPoint(contourPoint2);
CP.AddContourPoint(contourPoint3);
CP.Finish = "FOO";
CP.Profile.ProfileString = "PL200";
CP.Material.MaterialString = "Steel_Undefined";
CP.Insert();
return CP;
}
public void Example1()
{
Point point1 = new Point(0, 4000, 1000);
Point point2 = new Point(2000, 4000, 1000);
Point point3 = new Point(0, 6000, 3000);
Point point4 = new Point(0, 0, 0);
Point point5 = new Point(0, 2000, 0);
Point point6 = new Point(2000, 2000, 0);
Part contourPlate1 = CreateContourPlate(point1, point2, point3);
Part contourPlate2 = CreateContourPlate(point4, point5, point6);
BentPlate bentPlate = Operations.Operation.CreateBentPlateByParts(contourPlate1, contourPlate2);
}
}

Tekla.Structures.Model.BentPlate.#ctor
Initializes a new instance of the Tekla.Structures.Model.BentPlate class.

Tekla.Structures.Model.BentPlate.Geometry
Gets or sets the geometry of the bent plate.

Tekla.Structures.Model.BentPlate.Thickness
Gets thickness of the bent plate.

Tekla.Structures.Model.BentPlate.Insert
Inserts the bent plate into the model database. All the attributes must be set and geometry should have at least one bend.
Returns: True on success.

Tekla.Structures.Model.BentPlate.Select
Selects a bent plate object from the database.
Returns: True if success

Tekla.Structures.Model.BentPlate.Delete
Deletes the bent plate with this instance identifier from the model database.
Returns: True on success.

Tekla.Structures.Model.BentPlate.Modify
Modifies the bent plate object values in the database.
Returns: True if success

Tekla.Structures.Model.BentPlate.ToStruct(Tekla.Structures.ModelInternal.dotPart_t@)
Exports this to marshaling struct
p: the export struct

Tekla.Structures.Model.BentPlate.BentPlateParametersCheck
Examines whether bent plate parameters are well defined

Tekla.Structures.Model.BentPlate.ClearPositioning
Resets positioning attributes of this bent plate, to avoid side effects e.g. after explode

Tekla.Structures.Model.BentPlate.SelectInstance
Selects an instance of a bent plate
Returns: True if success

Tekla.Structures.Model.BentPlate.CreateInstance
Creates an instance of a bent plate
Returns: True if success

Tekla.Structures.Model.BentPlate.ModifyInstance
Modifies an instance of a bent plate
Returns: True if success